app/Filters/AuthFilter.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();

        if (!$session->get('isLoggedIn')) {
            return redirect()->to(site_url('login'))->with('error', 'Debes iniciar sesión para acceder a esta sección.');
        }

        // Verificar que el usuario continúe existiendo y con estado ACTIVO en BD
        $usuarioModel = new UsuarioModel();
        $usuario = $usuarioModel->find($session->get('usuario_id'));