app/Controllers/Compras.php

SELECT *
FROM `proveedores`
WHERE `estado` = 'ACTIVO'
SELECT *
FROM `productos`
WHERE `estado` = 'ACTIVO'
---
    public function nuevo()
    {
        if (!$this->usuarioModel->rolTienePermiso(session()->get('rol'), 'COMPRAS_CREAR')) {
            return redirect()->to('compras')->with('error', 'No tienes permisos para realizar esta acción.');
        }

        $data = [
            'titulo' => 'Nueva Compra',
            'proveedores' => $this->proveedorModel->where('estado', 'ACTIVO')->findAll(),
            'productos' => $this->productoModel->where('estado', 'ACTIVO')->findAll()

INSERT INTO `compras` (`proveedor_id`, `usuario_id`, `subtotal`, `total`, `observacion`, `estado`, `fecha`) VALUES ('2', '1', 200, 200, '', 'COMPLETADA', '2026-08-15 22:20:17')
---
    public function guardar()
    {
        if (!$this->usuarioModel->rolTienePermiso(session()->get('rol'), 'COMPRAS_CREAR')) {
            return $this->response->setJSON(['success' => false, 'message' => 'No tienes permisos para realizar esta acción.']);
        }

        $usuarioId = session()->get('usuario_id');
        $proveedorId = $this->request->getPost('proveedor_id');
        $observacion = $this->request->getPost('observacion');
        $items = $this->request->getPost('items');

        if (empty($items)) {
            return $this->response->setJSON(['success' => false, 'message' => 'Debe agregar al menos un producto.']);
        }

        $db = \Config\Database::connect();
        $db->transStart();

        try {
            $subtotal = 0;
            foreach ($items as $item) {
                $subtotal += $item['cantidad'] * $item['costo_unitario'];
            }
            $total = $subtotal;

            $compraId = $this->compraModel->insert([
                'proveedor_id' => $proveedorId,
                'usuario_id'   => $usuarioId,
                'subtotal'     => $subtotal,
                'total'        => $total,
                'observacion'  => $observacion,
                'estado'       => 'COMPLETADA',
                'fecha'        => date('Y-m-d H:i:s')
            ]);

SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'
---
            $proveedor = $this->proveedorModel->find($proveedorId);

            foreach ($items as $item) {
                $producto = $this->productoModel->find($item['producto_id']);

INSERT INTO `compra_detalle` (`compra_id`, `producto_id`, `cantidad`, `costo_unitario`, `subtotal`) VALUES (3, '1', '13', '15.384615384615385', 200)
UPDATE `productos` SET `stock_actual` = 140, `costo` = '15.384615384615385'
WHERE `productos`.`id` IN ('1')
INSERT INTO `movimientos_stock` (`producto_id`, `tipo_movimiento`, `cantidad`, `stock_anterior`, `stock_posterior`, `usuario_id`, `referencia_id`, `observacion`, `fecha`) VALUES ('1', 'COMPRA', '13', '127', 140, '1', 3, 'Compra #3 - Nueva proveedor', '2026-08-15 22:20:17')
---
                $stockPosterior = $stockAnterior + $item['cantidad'];

                // 1. Guardar detalle
                $this->compraDetalleModel->insert([
                    'compra_id'      => $compraId,
                    'producto_id'    => $item['producto_id'],
                    'cantidad'       => $item['cantidad'],
                    'costo_unitario' => $item['costo_unitario'],
                    'subtotal'       => $item['cantidad'] * $item['costo_unitario']
                ]);

                // 2. Actualizar stock y costo producto
                $this->productoModel->update($item['producto_id'], [
                    'stock_actual' => $stockPosterior,
                    'costo'        => $item['costo_unitario']
                ]);

                // 3. Registrar movimiento
                $db->table('movimientos_stock')->insert([
                    'producto_id'     => $item['producto_id'],
                    'tipo_movimiento' => 'COMPRA',
                    'cantidad'        => $item['cantidad'],
                    'stock_anterior'  => $stockAnterior,
                    'stock_posterior' => $stockPosterior,
                    'usuario_id'      => $usuarioId,
                    'referencia_id'   => $compraId,
                    'observacion'     => "Compra #$compraId - " . $proveedor['nombre'],
                    'fecha'           => date('Y-m-d H:i:s')
                ]);