app/Controllers/Productos.php

SELECT COUNT(*) AS `numrows`
FROM `venta_detalle`
WHERE `producto_id` = '1'
---
    public function index()
    {
        $db = \Config\Database::connect();
        $productosRaw = $this->productoModel->obtenerTodosConCategoria();

        // Verificar si cada producto tiene ventas
        $productos = array_map(function($p) use ($db) {
            $tieneVentas = $db->table('venta_detalle')
                        ->where('producto_id', $p['id'])
                        ->countAllResults() > 0;