app/Models/CategoriaModel.php

SELECT *
FROM `categorias`
WHERE `estado` = 'ACTIVO'
ORDER BY `nombre` ASC
---
    public function obtenerActivas(): array
    {
        return $this->where('estado', 'ACTIVO')
                    ->orderBy('nombre', 'ASC')
                    ->findAll();