app/Models/CompraDetalleModel.php

SELECT `compra_detalle`.*, `productos`.`nombre` as `producto_nombre`
FROM `compra_detalle`
JOIN `productos` ON `productos`.`id` = `compra_detalle`.`producto_id`
WHERE `compra_id` = '3'
---
    public function obtenerPorCompra($compra_id): array
    {
        return $this->select('compra_detalle.*, productos.nombre as producto_nombre')
                    ->join('productos', 'productos.id = compra_detalle.producto_id')
                    ->where('compra_id', $compra_id)
                    ->findAll();