app/Models/CompraModel.php

    public function obtenerTodasConRelaciones(): array
    {
        return $this->select('compras.*, proveedores.nombre as proveedor_nombre, usuarios.nombre as usuario_nombre')
                    ->join('proveedores', 'proveedores.id = compras.proveedor_id')
                    ->join('usuarios', 'usuarios.id = compras.usuario_id')
                    ->orderBy('compras.id', 'DESC')
                    ->findAll();
---
SELECT `compras`.*, `proveedores`.`nombre` as `proveedor_nombre`, `usuarios`.`nombre` as `usuario_nombre`
FROM `compras`
JOIN `proveedores` ON `proveedores`.`id` = `compras`.`proveedor_id`
JOIN `usuarios` ON `usuarios`.`id` = `compras`.`usuario_id`
ORDER BY `compras`.`id` DESC

    public function obtenerPorIdConRelaciones($id)
    {
        return $this->select('compras.*, proveedores.nombre as proveedor_nombre, usuarios.nombre as usuario_nombre')
                    ->join('proveedores', 'proveedores.id = compras.proveedor_id')
                    ->join('usuarios', 'usuarios.id = compras.usuario_id')
                    ->where('compras.id', $id)
                    ->first();
---
SELECT `compras`.*, `proveedores`.`nombre` as `proveedor_nombre`, `usuarios`.`nombre` as `usuario_nombre`
FROM `compras`
JOIN `proveedores` ON `proveedores`.`id` = `compras`.`proveedor_id`
JOIN `usuarios` ON `usuarios`.`id` = `compras`.`usuario_id`
WHERE `compras`.`id` = '3'
 LIMIT 1