app/Models/MeseroModel.php

SELECT *
FROM `meseros`
WHERE `estado` = 'ACTIVO'
ORDER BY `nombre` ASC
---
    public function obtenerActivos(): array
    {
        return $this->where('estado', 'ACTIVO')
                    ->orderBy('nombre', 'ASC')
                    ->findAll();