app/Models/ProductoModel.php

SELECT `productos`.*, `categorias`.`nombre` as `categoria_nombre`
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
ORDER BY `productos`.`id` ASC
---
    public function obtenerTodosConCategoria(): array
    {
        return $this->select('productos.*, categorias.nombre as categoria_nombre')
                    ->join('categorias', 'categorias.id = productos.categoria_id')
                    ->orderBy('productos.id', 'ASC')
                    ->findAll();

SELECT `productos`.*, `categorias`.`nombre` as `categoria_nombre`
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
WHERE `productos`.`estado` = 'ACTIVO'
AND `categorias`.`estado` = 'ACTIVO'
ORDER BY `productos`.`nombre` ASC
---
    public function obtenerActivosConCategoria(): array
    {
        return $this->select('productos.*, categorias.nombre as categoria_nombre')
                    ->join('categorias', 'categorias.id = productos.categoria_id')
                    ->where('productos.estado', 'ACTIVO')
                    ->where('categorias.estado', 'ACTIVO')
                    ->orderBy('productos.nombre', 'ASC')
                    ->findAll();