app/Models/PromocionModel.php

    public function obtenerTodasConDetalle($soloActivas = false): array
    {
        $builder = $this->orderBy('id', 'DESC');
        if ($soloActivas) {
            $builder->where('estado', 'ACTIVO');
        }
        $promociones = $builder->findAll();

        if (empty($promociones)) {
            return [];
        }

        $db = \Config\Database::connect();

        foreach ($promociones as &$promo) {
            $builderDet = $db->table('promocion_detalle pd');
            $builderDet->select('pd.cantidad, p.nombre as producto_nombre, p.estado as producto_estado');
            $builderDet->join('productos p', 'p.id = pd.producto_id');
            $builderDet->where('pd.promocion_id', $promo['id']);
            $query = $builderDet->get();
---
SELECT `pd`.`cantidad`, `p`.`nombre` as `producto_nombre`, `p`.`estado` as `producto_estado`
FROM `promocion_detalle` `pd`
JOIN `productos` `p` ON `p`.`id` = `pd`.`producto_id`
WHERE `pd`.`promocion_id` = '1'

            $promo['productos_resumen'] = implode('<br>', $resumen);

            // Verificar si tiene ventas asociadas
            $promo['tiene_ventas'] = $db->table('venta_detalle')->where('promocion_id', $promo['id'])->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `venta_detalle`
WHERE `promocion_id` = '1'